<?php

return [
	'get-directory-error' => '<fg=red>Ошибка получения рабочего каталога. Возможно не хватает доступа на чтение у одно из каталогов в цепочке.</>',
    'file-not-exist' => "<fg=red>Файла '%s' не существует",
    'success' => '<fg=green>Успешно выполнено</>',
    'exception' => "<fg=red>%s</>",
    'filepath' => 'Путь хранения файла конфигурации языка',
    'config-create' => 'Создание файла конфигурации языка',
    'config-create2' => 'Создаёт файл конфигурации языка',
    'language-init' => 'Создание структуры каталогов или создание таблицы под хранение текстов',
    'language-init2' => 'Создаёт структуру каталогов или создаёт таблицу под хранение текстов',
    'names' => 'Вывод имён текстов со всех конфигураций',
    'names2' => 'Выводит имёна текстов со всех конфигураций',
    'names3' => 'Имена всех конфигурация языка:\n',
    'locale' => 'Язык локали (ru, en и т.д.)',
];
