<?php
/**
 * Date: 28.05.2020
 * Time: 20:39
 * Author: Artem Aleksandrov
 */

declare (strict_types=1);

return [
    'Допускается одновременное использование нескольких хранилищ с разными источниками',
    "Значения в массивах 'names' должны быть уникальными на уровне приложения",
    'допустимые языки, первое значение будет значением по умолчанию',
    'имя набора фраз по умолчанию',
    'допустимо создать свою фабрику, унаследовав',
    'хранилища текстов',
    'конфигурация для хранения фраз в файлах',
    'тип хранилища для языка',
    'имена набора фраз, в файловом хранилище имена файлов',
    'путь к директории, которая будет хранить файлы в фразами',
    'конфигурация для хранения фраз в базе данных',
    'тип хранилища для языка',
    'имена набора фраз, в бд хранилище значение в колонке',
    'имя таблицы с фразами',
    'ограничение длины фразы в бд',
    'ограничение длины строки параметров в бд',
    'имена колонок',
    'допускается создать свой репозиторий, реализовав интерфейс',
    'конфигурация передаётся в конструктор репозитория внутри объекта DbConfig'
];